# Создаем исходный список
original_list = [3, 1, 4, 2]

# Используем метод sort() для сортировки исходного списка
original_list.sort()

# Выводим отсортированный исходный список
print("Сортировка с помощью метода sort():", original_list)

# Создаем новый список исходных данных
original_list = [3, 1, 4, 2]

# Используем функцию sorted() для создания нового отсортированного списка
sorted_list = sorted(original_list)

# Выводим отсортированный новый список
print("Сортировка с помощью функции sorted():", sorted_list)

# Выводим исходный список, чтобы показать, что он остался неизменным
print("Исходный список остался неизменным:", original_list)